{
  "metadata": {
    "title": "Khang Đào - Lập Trình Viên Front End",
    "description": "Thông tin về Khang Đào - Lập trình viên giao diện website (Front End Developer). Với các kỹ năng, kinh nghiệm và cũng như là án cá nhân và dự án nhóm.",
    "calculator": {
      "title": "Máy tính",
      "description": "Máy tính trực tuyến đơn giản và nhanh chóng – hỗ trợ cộng, trừ, nhân, chia, phần trăm và nhiều chức năng nâng cao,"
    },
    "xo3x3Game": {
      "title": "XO 3x3",
      "description": "XO 3x3 - Trò chơi cờ đam đơn giản, trí tuệ"
    },
    "todoList": {
      "title": "Danh sách công việc",
      "description": "Danh sách công việc – Quản lý công việc đơn giản và hiệu quả"
    }
  },
  "navigation": {
    "home": "Trang chủ",
    "about": "Giới thiệu",
    "showcase": "Năng lực",
    "experience": "Kinh nghiệm",
    "education": "Học vấn",
    "contact": "Liên hệ"
  },
  "header": {
    "languages": "Ngôn ngữ",
    "vi": "Tiếng Việt",
    "en": "Tiếng Anh"
  },
  "footer": {
    "text": "© {year} – Portfolio Khang Đào | Lập Trình Viên Front-End"
  },
  "home": {
    "hello": "Xin chào !",
    "name": "Tôi là ĐÀO VĨNH KHANG",
    "a": "",
    "webDeveloper": "Web Developer",
    "frontEndDeveloper": "Front End Developer",
    "welcome": "Chào mừng bạn đến với trang web cá nhân của tôi !",
    "download": "Tải CV",
    "cv": "CV_FRONT_END_DEVELOPER_VI.pdf"
  },
  "about": {
    "title": "Giới thiệu về tôi",
    "text-1": "Xin chào! Tôi tên là <strong>Đào Vĩnh Khang</strong>, sinh năm 2004, tốt nghiệp <strong>Cao đẳng FPT Polytechnic</strong> với chuyên ngành <strong>Web Development</strong>.",
    "text-2": "Hiện tại, tôi mong muốn được làm việc ở vị trí <strong>Intern/Fresher Front-End Developer</strong> để có cơ hội học hỏi, thực hành và nâng cao kiến thức cũng như kỹ năng chuyên môn.",
    "text-3": "Trong 1–2 năm tới, tôi đặt mục tiêu phát triển lên vị trí <strong>Junior Front-End Developer</strong>, tập trung cải thiện năng lực kỹ thuật, làm quen với môi trường làm việc thực tế và tích lũy kinh nghiệm thông qua các dự án thực tiễn.",
    "text-4": "Sau đó, tôi dự định học thêm <strong>Back-End</strong> để mở rộng kiến thức về hệ thống, hoàn thiện bản thân và từng bước hướng tới định hướng <strong>Full-Stack Developer</strong>.",
    "text-5": "Về dài hạn, tôi hướng tới mục tiêu trở thành <strong>Senior Front-End Developer</strong> (hoặc <strong>Full-Stack Developer</strong>), có khả năng xây dựng các sản phẩm chất lượng và đóng góp giá trị bền vững cho doanh nghiệp.",
    "text-6": "<strong>Vài điều về bản thân:</strong> Tôi là người vui vẻ, hòa đồng và luôn sẵn sàng học hỏi kiến ​​thức mới. Tôi mong muốn được làm việc trong một môi trường chuyên nghiệp, nơi tôi có thể áp dụng những gì đã học, phát triển các kỹ năng thực tiễn và tích cực đóng góp vào sự phát triển chung của nhóm và công ty."
  },
  "showcase": {
    "title": "Năng lực",
    "description": "Tổng quan về các kỹ năng, dự án và sản phẩm mẫu của tôi trong lĩnh vực phát triển website.",
    "skills": "Kỹ năng",
    "projects": "Dự án",
    "demos": "Demo",
    "showcaseList": {
      "html": {
        "name": "HTML",
        "level": "cao cấp"
      },
      "css": {
        "name": "CSS",
        "level": "cao cấp"
      },
      "js": {
        "name": "JavaScript",
        "level": "cao cấp"
      },
      "ts": {
        "name": "TypeScript",
        "level": "trung cấp"
      },
      "reactjs": {
        "name": "React.js",
        "level": "trung cấp"
      },
      "nextjs": {
        "name": "Next.js",
        "level": "trung cấp"
      },
      "expressjs": {
        "name": "Express.js",
        "level": "trung cấp"
      },
      "mongodb": {
        "name": "MongoDB",
        "level": "trung cấp"
      },
      "tailwindcss": {
        "name": "Tailwind CSS",
        "level": "trung cấp"
      },
      "github": {
        "name": "GitHub",
        "level": "trung cấp"
      },
      "figma": {
        "name": "Figma",
        "level": "trung cấp "
      }
    },
    "projectList": {
      "portfolio": {
        "name": "Portfolio",
        "description": "Trang web giới thiệu về bản thân tôi, các kỹ năng chuyên môn, các Framework đã sử dụng, kinh nghiệm cũng như các dự án nhóm và các dự án cá nhân của tôi."
      },
      "elecking": {
        "name": "Elecking website",
        "description": "Đây là một trang web thương mại điện tử chuyên bán các sản phẩm điện tử, tích hợp đầy đủ các tính năng như tìm kiếm, lọc, sắp xếp sản phẩm, giỏ hàng và thanh toán trực tuyến qua VNPAY. <br/> Người dùng có thể đăng ký, đăng nhập, khôi phục mật khẩu, cập nhật thông tin cá nhân, địa chỉ và mật khẩu, và được phân quyền theo vai trò để đảm bảo an ninh. Hệ thống hỗ trợ quản lý đơn hàng, áp dụng mã giảm giá và theo dõi trạng thái giao hàng. <br/> Quản trị viên (Admin) có quyền truy cập vào bảng điều khiển thống kê hàng tháng và hàng năm, và thực hiện các thao tác quản lý (CRUD) trên các bảng dữ liệu như sản phẩm, đơn hàng, danh mục, người dùng, thương hiệu, v.v. để đảm bảo hệ thống hoạt động và quản lý hiệu quả."
      },
      "cellphones": {
        "name": "Cellphones - Clone",
        "description": "Thiết kế và phát triển website dựa trên giao diện 'CellphoneS', tích hợp các tính năng như tìm kiếm, lọc, sắp xếp sản phẩm, quản lý giỏ hàng, đăng nhập, đăng ký, khôi phục mật khẩu và hệ thống quản trị với đầy đủ chức năng CRUD."
      },
      "chatApp": {
        "name": "Chat App",
        "description": "Ứng dụng chat thời gian thực sử dụng Firebase, tích hợp đăng nhập bằng Google, Facebook, tạo phòng chat và mời người khác vào phòng."
      }
    },
    "demoList": {
      "calculator": {
        "name": "Máy tính"
      },
      "xo3x3": {
        "name": "Trò Chơi XO 3x3"
      },
      "todolist": {
        "name": "Danh sách công việc"
      }
    }
  },
  "experience": {
    "title": "Kinh nghiệm",
    "description": "Tổng quan về hành trình học tập và phát triển kỹ năng của tôi trong lĩnh vực phát triển web.",
    "workStages": {
      "tinviet": {
        "time": "12/2024 - 04/2025",
        "position": "Thực tập sinh Front-End",
        "company": "Công ty giải pháp phần mền Tín Việt",
        "description": {
          "text-1": "Trong thời gian thực tập, tôi có cơ hội làm việc trong môi trường phát triển Front-End chuyên nghiệp và được tiếp xúc với quy trình phát triển sản phẩm theo nhóm. Tôi đã làm quen với việc phân công nhiệm vụ, thảo luận yêu cầu và cộng tác với các thành viên trong nhóm để hoàn thành các nhiệm vụ được giao một cách hiệu quả.",
          "text-2": "Tôi được hướng dẫn qua nhiều giai đoạn của quá trình phát triển Front-End, bao gồm phân tích yêu cầu, phát triển giao diện người dùng và hỗ trợ hoàn thiện các tính năng của ứng dụng bằng cách làm việc với các nhà phát triển giàu kinh nghiệm.",
          "text-3": "Tôi đã nâng cao kỹ năng làm việc nhóm, tư duy giải quyết vấn đề và hiểu sâu hơn về quy trình phát triển ứng dụng web trong môi trường kinh doanh chuyên nghiệp."
        },
        "projects": {
          "vieclamsanxuat": {
            "name": "Vieclamsanxuat",
            "position": "Front-End Developer",
            "description": "Phát triển giao diện website theo yêu cầu và triển khai các tính năng như hiển thị dữ liệu, tìm kiếm, lọc, sắp xếp, thiết kế đáp ứng và xác thực biểu mẫu."
          }
        }
      },
      "dxdlabs": {
        "time": "09/2025 - 11/2025",
        "position": "Thực tập sinh Front-End",
        "company": "Công ty TNHH DXD Labs",
        "description": {
          "text-1": "Trong thời gian thực tập, tôi làm việc theo hình thức remote, tập trung thực hiện các nhiệm vụ Front-End được giao thông qua hệ thống quản lý và trao đổi công việc trực tuyến (Slack). Tôi chủ động tiếp nhận yêu cầu, trao đổi với các thành viên trong nhóm và báo cáo tiến độ thường xuyên nhằm đảm bảo công việc được hoàn thành đúng thời hạn.",
          "text-2": "Quá trình làm việc từ xa giúp tôi nâng cao khả năng tự học, tự quản lý thời gian và giải quyết vấn đề một cách độc lập. Đồng thời, tôi rèn luyện kỹ năng giao tiếp chuyên nghiệp trong môi trường trực tuyến và thích nghi với quy trình làm việc phân tán, khác biệt so với hình thức làm việc trực tiếp tại văn phòng.  "
        },
        "projects": {
          "luxdao": {
            "name": "LUX DAO",
            "position": "Front-End Developer",
            "description": "Chỉnh sửa và phát triển giao diện website theo yêu cầu, bao gồm xây dựng và triển khai thiết kế đáp ứng (responsive design), xử lý xác thực biểu mẫu và khắc phục các lỗi CSS."
          },
          "vangxanh": {
            "name": "Vàng Xanh",
            "position": "Front-End Developer",
            "description": "Xây dựng và phát triển giao diện website dựa trên các thiết kế từ Figma, tích hợp và gọi API để hiển thị dữ liệu, triển khai thiết kế đáp ứng (responsive design) và xử lý xác thực biểu mẫu."
          }
        }
      }
    }
  },
  "education": {
    "title": "Học Vấn",
    "description": "Tổng quan về hành trình học tập và phát triển của tôi trong lĩnh vực phát triển web.",
    "fpoly": {
      "nameSchool": "Trường Cao đẳng FPT Polytechnic",
      "major": "Chuyên ngành",
      "myMajor": "Phát triển Website",
      "time": "11/2022 - 08/2025",
      "text-1": "Trong quá trình học tập, tôi được trang bị nền tảng vững chắc về phát triển web Front-End, bao gồm <strong>HTML5</strong>, <strong>CSS3</strong>, <strong>JavaScript</strong>, <strong>TypeScript</strong>, <strong>Figma</strong> cùng các thư viện và framework hiện đại như <strong>React.js</strong>, <strong>Next.js</strong>, <strong>Tailwind CSS</strong>, <strong>Bootstrap</strong> và <strong>Ant Design</strong>. Tôi luôn sử dụng <strong>Git</strong> để quản lý mã nguồn và phối hợp làm việc trong quá trình phát triển dự án.",
      "text-2": "Bên cạnh đó, tôi cũng có kiến thức cơ bản về <strong>Back-End</strong> như <strong>JSON Server</strong>, <strong>RESTful API</strong>, <strong>Node.js</strong>, <strong>Express.js</strong> và <strong>MongoDB</strong>, giúp tôi hiểu rõ hơn cách Front-End tương tác với hệ thống phía server và xây dựng các ứng dụng web hoàn chỉnh.",
      "text-3": "Trong quá trình học tập và thực hiện dự án, tôi thường xuyên sử dụng các công cụ hỗ trợ phát triển như <strong>Fork</strong>, <strong>Postman</strong>, <strong>Docker</strong>, <strong>GitHub</strong> và <strong>GitLab</strong> nhằm tối ưu quy trình làm việc và nâng cao hiệu quả triển khai sản phẩm.",
      "text-4": "Ngoài kiến thức chuyên môn, tôi rèn luyện được tư duy logic, khả năng tự học và tinh thần trách nhiệm cao, luôn hoàn thành công việc đúng thời hạn để đảm bảo tiến độ học tập cũng như kế hoạch làm việc của nhóm, đồng thời chủ động phối hợp và hỗ trợ các thành viên nhằm đạt được hiệu quả tốt nhất."
    }
  },
  "contact": {
    "title": "Liên hệ với tôi",
    "description": "Bạn có hứng thú hợp tác hoặc có câu hỏi nào không? Vui lòng liên hệ với tôi bằng cách sử dụng biểu mẫu bên dưới hoặc qua bất kỳ phương thức liên hệ nào được cung cấp. Tôi rất mong nhận được phản hồi từ bạn!",
    "myAddress": "Quận 12, Thành phố Hồ Chí Minh",
    "phone": "Số điện thoại",
    "email": "Email",
    "address": "Địa chỉ",
    "yourName": "Tên của bạn",
    "placeholderName": "Nhập tên của bạn",
    "matchesName": "Tên không hợp lệ. Vui lòng viết đúng định dạng (có dấu, viết hoa chữ cái đầu).",
    "requiredName": "Vui lòng nhập tên của bạn",
    "yourEmail": "Email của bạn",
    "placeholderEmail": "Nhập email của bạn",
    "matchesEmail": "Định dạng email không hợp lệ. Vui lòng nhập địa chỉ email hợp lệ.",
    "requiredEmail": "Vui lòng nhập email của bạn",
    "yourMessage": "Tin nhắn của bạn",
    "placeholderMessage": "Nhập tin nhắn của bạn",
    "requiredMessage": "Vui lòng nhập tin nhắn của bạn",
    "notiSuccess": "Tôi đã nhận được tin nhắn của bạn! Tôi sẽ trả lời bạn sau.",
    "notiError": "Đã xảy ra lỗi trong quá trình gửi tin nhắn của bạn. Vui lòng thử lại sau.",
    "sendMessage": "Gửi tin nhắn"
  },
  "calculator": {
    "title": "Máy tính",
    "divideByZero": "Không thể chia cho 0",
    "invalidInput": "Đầu vào không hợp lệ"
  },
  "xo3x3": {
    "title": "Trò Chơi XO 3x3",
    "resetGame": "Chơi lại",
    "winner": "Người thắng",
    "draw": "Hòa!",
    "currentTurn": "Lượt hiện tại"
  },
  "todolist": {
    "title": "Danh sách công việc",
    "task": "Công việc",
    "add": "Thêm",
    "taskPlaceholder": "Nhập công việc của bạn",
    "taskRequired": "Vui lòng nhập một công việc",
    "noTasks": "Không có công việc nào",
    "deleteTask": "Xóa",
    "deleteSelectedTasks": "Xóa các công việc đã chọn"
  }
}